Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེའི་ཕྱིར། །ཡོན་གནས་སོ་སོར་བཞེས་པར་མཛད། །
en: Out of great love for sentient beings He accepts the role of a recipient of offerings.

source: བསྐལ་པ་བྱེ་བ་སྟོང་ཕྲག་ཏུ། །དེ་བཞིན་གཤེགས་པ་དེ་བཞུགས་ཏེ། །
en: “ ‘For billions of eons This Thus-Gone One remains.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས། །འཁྲུག་པ་མི་མངའ་འདོད་ཆགས་བྲལ། །
en: Great King, the Thus-Gone One Is never disturbed and always free of desire.

source: སེམས་ཅན་ཀུན་ལ་ཐུགས་བརྩེའི་ཕྱིར། །ཡོན་ནི་སོ་སོར་བཞེས་པར་མཛད། །
en: “ ‘With great love for all beings He accepts the role of a recipient of offerings,

source: ཡོངས་སུ་གསོལ་ནས་སྟོན་པར་མཛད། །ཡོན་གྱི་འབྲས་བུ་འདི་ཡིན་ནོ། །
en: And upon request he teaches— Such is the effect of offerings.

source: ཐུབ་པ་འཇིག་རྟེན་ཀུན་ལ་མཁས། །
en: “ ‘The sage is an expert on the world

source: འཇིག་རྟེན་གསུམ་གྱི་བསོད་ནམས་ཞིང་། །
en: And a field of merit for the threefold world.

source: དེ་དྲུང་སོང་ལ་བསྙེན་བཀུར་གྱིས། །དེ་ནི་ཁྱོད་ཀྱི་ལུང་སྟོན་མཛད། །
en: Go to him and venerate him, Then he shall make things clear to you.’

source: དེ་ནས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་ལྷ་དེས་བསྐུལ་བ་དྲན་ནས། དེའི་མཚན་མོ་འདས་ཏེ། དེའི་བློན་པོ་རྣམས་བསྡུས་སོ། །བསྡུས་ནས་སྨྲས་པ།
en: “King Beyond Doubt kept the god’s exhortation in mind, and when the night was over he gathered his ministers and said,

source: གྲོང་གི་གཙོ་བོ་དག་གང་ཤེས་པར་གྱིས་ཤིག །
en: ‘O village chiefs, you must know this.

source: ཤར་ཕྱོགས་ཀྱི་ཕྱོགས་ཆ་ན་གྲོང་ཆེན་པོ་ལྷུན་པོ་འབྱུང་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: To the east of here lies the city called Emerging Mounts.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷ་ཞེས་བྱ་བ་བཞུགས་སོ། །
en: In that city resides a thus-gone one known as Banyan.

source: དེ་ལ་བསྙེན་བཀུར་བྱ་བར་འདོང་གིས། བཞོན་པ་བཟང་པོ་དག་མྱུར་དུ་སྦྱོར་ཅིག་དེ་བཞིན་གཤེགས་པ་དེ་བལྟ་བའི་ཕྱིར་དེ་རིང་ཉིད་འདོང་ངོ་། །
en: I wish to venerate that Thus-Gone One, so, quickly, bring good horses. I shall leave now so that I may see him today.’

source: བློན་པོ་དེ་དག་གིས་ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་དེའི་ལྟར་མཉན་ནས་བཞོན་པ་བཟང་པོ་དག་སྦྱར་ཏོ། །
en: “ ‘As Your Majesty commands!’ replied the ministers, and so they brought fine horses just as King Beyond Doubt had told them.

source: དེ་ནས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པས་བཙུན་མོ་ལ་བཀའ་སྩལ་པ།
en: “King Beyond Doubt then spoke to his queen:

source: ཆུང་མ་གང་ཤེས་པར་གྱིས་ཤིག །
en: ‘Know this, O wife.

source: ང་དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་བལྟ་བའི་ཕྱིར་འགྲོ་ཡིས་བག་ཡོད་པར་སྒྲུབས་ཤིག །
en: I am leaving to see the thus-gone King of Banyan Trees. Meanwhile you must act with prudence.’

source: དེ་བཞིན་གཤེགས་པ་དེ་བདག་ཅག་གིས་བལྟ་བར་རྔོ་ཐོགས་སམ།
en: ‘Will we also be able to see the Thus-Gone One?’

source: སྨྲས་པ་ཆུང་མ་ནུས་སོ། །
en: “ ‘Yes, wife,’ answered the king, ‘you will.’

source: སྨྲས་པ། ལྷ་དེ་ལྟ་ན་དེ་བཞིན་གཤེགས་པ་དེ་བལྟ་བའི་ཕྱིར་བདག་ཅག་ཀྱང་མཆིའོ། །
en: “ ‘Your Majesty,’ replied the queen, ‘if that is so then we shall also come to behold the Thus-Gone One.’

source: སྨྲས་པ་ཆུང་མ་གང་གིས་དུས་ལ་དབབ་པར་ཤེས་ན་འདོང་ངོ་། །
en: “ ‘Wife,’ answered the king, ‘proceed if you know that the time has come.’

source: དེ་ནས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་བལྟ་བར་འདོད་པ་དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་དེ་བལྟ་བའི་ཕྱིར་རྒྱལ་སྲིད་ལྟོས་པ་མེད་པ་དང་། ཡོངས་སུ་འཛིན་པ་ལྟོས་པ་མེད་པས་རང་རང་གི་གྲོང་ཁྱེར་ནས་བྱུང་ངོ་། །
en: “Thus, without any second thoughts about his kingdom and possessions, King Beyond Doubt left behind his city and traveled to see the thus-gone King of Banyan Trees.

source: དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་སངས་རྒྱས་ཀྱི་སྤྱན་སྒྲིབ་པ་མེད་པས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་དེ་རང་གི་གྲོང་ཁྱེར་ནས་བྱུང་བ་གཟིགས་སོ། །
en: Possessing the stainless buddha eye, the thus-gone King of Banyan Trees saw that King Beyond Doubt was leaving his city.

source: གཟིགས་ནས་རྒྱལ་པོའི་ལམ་ཐམས་ཅད་དཔག་བསམ་གྱི་རས་བཅོས་བུ་མངོན་པར་སྤྲུལ་པ་རྣམས་ཀྱིས་ཡང་དག་པར་གཡོགས་སོ། །
en: He then emanated a wish-fulfilling cotton fabric, suspended above the entire path traveled by the king.

source: ཡུལ་དང་ཕྱོགས་རྣམས་སུ་ཡང་མཚོ་དང་མཚེའུ་དང་རྫིང་དག་མངོན་པར་སྤྲུལ་ཏོ། །
en: Along the way he created lakes, pools, and ponds,

source: རྒྱལ་པོ་དེའི་ལམ་ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་ཅིང་དཔག་བསམ་གྱི་རས་བཅོས་བུ་མངོན་པར་སྤྲུལ་པས་ཤིན་ཏུ་གཡོགས་ཤིང་རླུང་བསིལ་བ་དག་རབ་ཏུ་ལྡང་ངོ་། །
en: and he made the road as even as the palm of a hand. Fanned by a cooling breeze, the king thus traveled beneath the wish-fulfilling fabric that the thus-gone King of Banyan Trees had emanated.

source: གནས་གཙང་མའི་ལྷ་རྣམས་ལ་བཀའ་སྩལ་པ།
en: “The Thus-Gone King of Banyan Trees then addressed the gods of the pure abodes:

source: སོང་ལ་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པའི་ལམ་སྤོས་ཆུས་ཆག་ཆག་ཐོབ་ཤིག །
en: ‘Go sprinkle with scented water the path that King Beyond Doubt is traveling.

source: སྟེང་དུ་ཡང་རས་བཅོས་བུ་སྣ་ཚོགས་ཀྱི་བླ་བྲེ་བྲེས་ཤིག །
en: Let his path be covered by numerous canopies.

source: དེ་འོང་བའི་རིམ་གྲོ་ཡོངས་སུ་སྤྱད་པར་གྱིས་ཤིག །
en: Prepare his welcome ceremony.’

source: དེ་ནས་གནས་གཙང་མའི་ལྷ་དག་དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་ལྟར་མཉན་ནསརྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འབད་པས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་ལ་མཆོད་པ་བྱེད་དོ། །
en: “The gods of the pure abodes did as instructed, and so they endeavored to bring offerings to King Beyond Doubt, using their miraculous powers .

source: དེ་ནས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་རྒྱལ་པོའི་ལམ་གྱི་འབྱོར་པ་དེ་དག་མཐོང་ནས་བློན་པོ་དག་ལ་སྨྲས་པ།
en: Seeing all these gifts of provisions for his journey, the king said to his ministers,

source: གྲོང་གི་གཙོ་བོ་དག་མིའི་གཟུགས་ལས་འདས་པའི་སྐྱེས་བུ་ལྷའི་གཟུགས་དང་ལྡན་པ་ང་ལ་མཆོད་པ་བྱེད་པ་འདི་དག་ག་ལས་འོངས་གང་བདག་ལ་མཆོད་པ་བྱེད་པའི་རྒྱུ་འདི་དག་ནི། དེ་དག་བདག་གི་དྲུང་ན་མེད་དོ། །
en: ‘Village chiefs, how is it possible that divine beings, whose bodies are vastly superior to those of humans, are in this way worshiping me? I do not possess anything that could cause such offerings to be made.’

source: དེ་ནས་གཉེན་རྙིང་བ་སྣག་གི་གཉེན་མཚམས་ལྷ་དེས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The god who was an old friend and relative of the king then spoke these verses:

source: ལྷ་འདི་དག་ནི་འཇིག་རྟེན་གྱི། །མགོན་པོ་དེ་ཡི་རིམ་གྲོ་པ། །
en: “ ‘Your Majesty, what you witness is the ceremony Of the world’s protector.

source: དེ་བཞིན་གཤེགས་པའི་བཀའ་ཡིས་སུ། །མཆོད་པ་དམ་པ་བྱེད་པ་ཡིན། །
en: By the command of the Thus-Gone One These offerings are brought here.

source: རྒྱལ་པོ་ཕོ་བྲང་ནས་བྱུང་བ། །སངས་རྒྱས་ཀྱིས་ནི་ལྷ་གཟིགས་སོ། །
en: “ ‘With his divine eye the Buddha has seen Your Majesty leaving the royal palace.

source: ཁྱོད་ནི་འོང་བར་ཤེས་ནས་སུ། །ལྷ་རྣམས་ཀྱིས་ནི་རབ་ཏུ་བརྒྱུགས། །
en: As he knows that you are coming, He has made the gods busy.

source: བཞུད་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡི། །མཆོད་པ་དག་ནི་དམ་པ་མཛོད། །
en: “ ‘They fulfill his command To render perfect service to the bodhisattva.

source: འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་ཡིས། །ཁྱོད་ལ་དེ་ནི་ཐུགས་བརྩེའི་ཕྱིར། །དེ་ཡིས་ལྷ་ནི་དེ་དག་བཏང་། །མཆོད་པ་དག་ནི་དམ་པ་བྱེད། །
en: The protector and savior of the world Has great love for you. “ ‘Thus he has sent these gods To bring fine offerings,

source: སངས་རྒྱས་མཐོང་བར་འདོད་པ་ཡི། །རྒྱལ་པོའི་ལམ་ནི་རྒྱན་གྱིས་བརྒྱན། །
en: And to adorn the road traveled by the king Who wishes to see the Buddha.

source: རྒྱལ་པོ་ཆེན་པོ་མངོན་བྱུང་ཤིག །
en: “ ‘Go forth, Great King!

source: གང་ཟག་མཆོག་ལ་བྱང་ཆུབ་སེམས། །ཉན་ཐོས་རྣམས་ཀྱིས་མདུན་བདར་ཅིང་། །མཆོད་པ་བྱེད་པ་མ་མཐོང་ངམ། །
en: Do you not see the bodhisattvas and hearers, Worshiping and bringing fine offerings To the supreme man?’

source: དེ་ནས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པས་ལྷ་དེའི་ཚིག་ཐོས་ནས་ཤིང་རྟ་ལས་བབས་ཏེ
en: “Having heard these words of the god, King Beyond Doubt descended from his chariot.

source: གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར། རྒྱན་བཀྲོལ། ནོར་བུའི་མཆིལ་ལྷམ་ཕུད་ནས། །བཅོམ་ལྡན་འདས་ཕྱོགས་ག་ལ་བཞུགས་པའི་ཕྱོགས་དེར་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: He draped his shawl over one shoulder, stripped himself of all adornments, took off his bejeweled footwear, and then joined his palms in the direction of the Blessed One’s residence.

source: དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །ཕྱག་འཚལ་ལོ། །ཕྱག་འཚལ་ལོ་ཞེས་ཆེད་དུ་རྗོད་པ་འདི་ལན་གསུམ་དུ་བརྗོད་དོ། །
en: ‘Thus-Gone King of Banyan Trees,’ he exclaimed, ‘homage, homage, homage to you!’

source: དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་འཁོར་འབུམ་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བདར་བས། རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་ཕྱག་འཚལ་བར་བྱེད་པ་གཟིགས་སོ། །གཟིགས་ནས་ཀྱང་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: “Surrounded by his attending retinue of many hundreds of thousands, the thus-gone King of Banyan Trees saw that King Beyond Doubt paid homage to him in this way, and in response he spoke these verses:

source: གང་དག་གིས་ནི་འཇིག་རྟེན་མགོན་པོ་ལ། །དགའ་བའི་སེམས་ཀྱིས་གོམ་པ་གཅིག་བོར་བ། །འཛམ་བུའི་ཆུ་ཀླུང་གསེར་སྲང་འབུམ་གྲངས་རྙེད། །དེ་ནི་དེ་དང་མཚུངས་པ་ཡོད་མ་ཡིན།
en: “ ‘Joyfully taking one step In the direction of the world’s protector Is more valuable than a hundred thousand measures Of gold from the Jāmbū River.

source: གང་དག་གིས་ནི་འཇིག་རྟེན་མགོན་པོ་ལ། །དགའ་བའི་སེམས་ཀྱིས་གོམ་པ་གཅིག་བོར་བ། །འཛམ་བུའི་ཆུ་ཀླུང་གསེར་སྲང་བྱེ་བ་གཉིས། །དེ་ནི་དེ་དང་མཚུངས་པ་ཡོད་མ་ཡིན། །
en: “ ‘Joyfully taking one step In the direction of the world’s protector Is more valuable than twenty million measures Of gold from the Jāmbū River.

source: གང་དག་གིས་ནི་འཇིག་རྟེན་མགོན་པོ་ལ། །བསྙེན་བཀུར་བྱ་ཕྱིར་གོམ་པ་གཅིག་བོར་བ། །འཛམ་བུའི་ཆུ་ཀླུང་གསེར་སྲང་བྱེ་བ་དག །དེ་ནི་དེ་དང་མཚུངས་པ་ཡོད་མ་ཡིན། །
en: “ ‘Taking one step to pay homage To the protector of the world Is more valuable than tens of millions of measures Of gold from the Jāmbū River.’

source: དེ་ནས་གནས་གཙང་མའི་ལྷ་དག་གིས། བཅོམ་ལྡན་འདས་འཁོར་དང་བཅས་པ་ཀུན་ལ་ཀུན་ཏུ་དགབ་པར་བྱ་བའི་དོན་དུ་གོས་འབུམ་ཕྲག་བརྒྱད་ཅུ་དག་མངོན་པར་སྤྲུལ་ཏོ། །
en: “At this point the gods of the pure abodes emanated eight million pieces of fabric in order to shelter the Blessed One and his retinue.

source: དེ་ནས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པས་དེ་བཞིན་གཤེགས་པ་ལ་དེ་ལྟ་བུའི་མཆོད་པ་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: When King Beyond Doubt saw how the gods brought forth such offerings to the Thus-Gone One, he wondered,

source: གདུགས་འདི་དག་ག་ལས་འོངས་ཤིག་སྙམ་མོ། །
en: ‘Where do these parasols come from?’

source: དེའི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་གདུགས་དེ་དག་མི་སྣང་བར་གྱུར་ནས།
en: Yet at that very moment they all vanished.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གདུགས་འདི་དག་གར་སོང་སྙམ་མོ། །
en: ‘Where did all the parasols go?’ thought the king.

source: དེ་ནས་ལྷ་དེ་དག་གིས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The gods then spoke these verses to King Beyond Doubt:

source: གདུགས་ནི་གང་ནས་མ་སྐྱེས་ཤིང་། །
en: “ ‘The parasols do not come about anywhere;

source: གང་དུ་ཡང་ནི་འགགས་མ་གྱུར། །
en: Neither do they cease anywhere.

source: ཆོས་ཀུན་དངོས་པོ་འདི་འདྲ་སྟེ། །
en: Such is the nature of all phenomena,

source: དེ་ནི་སངས་རྒྱས་རྣམ་པར་མཁྱེན། །
en: And this is what the buddhas understand.

source: འཇིག་རྟེན་གསལ་མཛད་འདི་འདྲ་སྟེ། །
en: “ ‘Such is the way of the illuminators of the world

source: ཆོས་ཉིད་དེ་དག་འདི་འདྲའོ། །
en: And such is the intrinsic nature of things.

source: གང་དག་དེ་ནི་རྣམ་ཤེས་པ། །དེ་དག་སངས་རྒྱས་ཐུགས་ལས་བྱུང་། །
en: Those who understand this Have been born from the heart of the buddhas.

source: དེ་ནི་བདུད་ཀྱི་ཞགས་བཅད་ནས། །སངས་རྒྱས་ལམ་དུ་ཉེ་བར་ཞུགས། །
en: “ ‘Breaking the shackles of the māras, They enter the path of the buddhas.

source: འཇིག་རྟེན་གསལ་བར་མཛད་པ་མཐོང་། །བདུད་འདུལ་བར་ནི་འགྲོ་བར་འགྱུར། །
en: Seeing the world illuminator s, They proceed to tame the māras.

source: ལྷ་རྣམས་དང་ནི་མི་ཆེན་གྱིས། །ལུང་བསྟན་འདི་ནི་ཐོས་ནས་སུ། །བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉིད་དག །དཔའ་བོ་ཆེན་པོས་ལུང་བསྟན་པ། །
en: “ ‘Whoever hears this declaration Made by gods and great humans Will be confirmed by the great hero As having the nature of a bodhisattva.

source: དེ་ནི་བཅིངས་མེད་གྲོལ་བ་མེད། །ལམ་ཆེན་ལ་ནི་བྱ་བ་བྱས། །སངས་རྒྱས་ཆོས་ནི་བླ་ན་མེད། །དཔའ་བོ་ཆེན་པོས་ལུང་བསྟན་པ། །
en: “ ‘Without bondage or liberation, And having accomplished all tasks along the great path, The great hero teaches The unsurpassed Dharma of the buddhas.

source: འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་ཡི། །དེ་ཡི་གསུང་ནི་ཐོས་ནས་སུ། །འོངས་པ་མེད་ཅིང་བྱུང་བ་མེད། །གནས་པ་མེད་པར་རྣམ་པར་ཤེས། །
en: “ ‘Whoever hears the voice Of the world’s protector Understands that there is No coming, arising, or abiding.

source: དེ་ཡི་ལུང་བསྟན་ཐོས་ནས་སུ། །ཆོས་ནི་གང་ཡང་མ་བྱུང་ཞིང་། །འགགས་པ་མེད་ཅིང་མི་གནས་པར། །ལྷ་དག་གིས་ནི་རྣམ་པར་མཐོང་། །
en: “ ‘For those who receive this teaching No phenomena come into being, Nothing ceases, and nothing remains. This is what the gods see.

source: དེ་ཡི་གསུང་དེ་ཐོས་ནས་སུ། །སྐྱེ་བོ་མང་པོ་དེ་ཀུན་དག །སྟོང་པའི་ཆོས་ནི་རྣམ་ཤེས་ཏེ། །
en: “ ‘When hearing these words All the many beings Will recognize empty phenomena.

source: འགགས་པ་མེད་ཅིང་མ་འོངས་མེད། །
en: Nothing has ceased and nothing will come.

source: ཆོས་གང་འདས་པའང་མ་ཡིན་ཏེ། །རྣམ་པར་ཤེས་མེད་མ་འོངས་མེད། །
en: “ ‘Neither are there any past phenomena, And no consciousness and no future.

source: ཆོས་རྣམས་ཀུན་གྱི་ངོ་བོ་ཉིད། །རྒྱལ་བའི་སྲས་དག་རྣམ་པར་ཤེས། །
en: The very essence of all phenomena Is understood by the children of the victorious ones.

source: དེ་ཡི་ཚིག་དེ་ཐོས་ནས་སུ། །ཆོས་ནི་ཐམས་ཅད་མཚན་ཉིད་གཅིག །
en: “ ‘For whoever hears these words All phenomena are of the same characteristic.

source: སངས་རྒྱས་བྱང་ཆུབ་ཐུབ་ཆེན་གང་། །ཐམས་ཅད་དེ་ལ་རབ་ཏུ་ཞུགས། །
en: The buddhas, the great sages of great awakening, Have all entered into this.

source: དེ་ཡི་ཚིག་དེ་ཐོས་ནས་སུ། །དེ་ཚེ་དེ་བཞིན་གཤེགས་བྱུང་གང་། །རྒྱལ་བ་བྱེ་བ་སྤྲུལ་མཛད་ནས། །སྟོང་པའི་ཆོས་ནི་རབ་ཏུ་སྟོན། །
en: “ ‘When someone hears these words, And a thus-gone thus appears, Ten million victorious ones will be emanated, Teaching the Dharma of emptiness.

source: ལྷ་ནི་ཁྲི་ཕྲག་བརྒྱད་ཅུ་དག །དེ་དག་ལ་ནི་དེ་བཞིན་གཤེགས། །འཇིག་རྟེན་གསལ་མཛད་བྱང་ཆུབ་ལམ། །སྦྱོང་བར་མཛད་པས་ལུང་བསྟན་ཏོ། །
en: “ ‘To eight hundred thousand gods The Thus-Gone One, illuminator of the world And the master of the path of awakening, Has given his teaching.’

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that King Beyond Doubt was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Beyond Doubt.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདས་པའི་དགེ་བའི་རྩ་བ་དག་ཡང་དག་པར་བསྡུ་བའི་དོན་དུ་ཆོས་ཐམས་ཅད་ལ་སྐྱེ་བ་མེད་པའི་ཆོས་འཐོབ་པར་བྱ་བའི་ཕྱིར་འབད་པར་བྱའོ། །
en: Maudgalyāyana, bodhisattva great beings should therefore endeavor to obtain the unborn Dharma so that they may gather transcendent roots of virtue.

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་གནས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ལ་རྣམ་པར་གནས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས། དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the origin as related to knowledge of abiding. I did this by realizing knowledge of the cessation of peaceful liberation and then wondering how to teach this genuinely to sentient beings.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་ཅེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a thus-gone one named Unfathomable Light Rays;

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་དེའི་ཉན་ཐོས་འདུས་པ་དང་པོ་ནི་ཉན་ཐོས་བྱེ་བ་ཕྲག་དགུ་བཅུ་བྱུང་ངོ་། །
en: In the thus-gone Unfathomable Light Rays’ first assembly of hearers there were nine hundred million,

source: ཉན་ཐོས་འདུས་པ་གཉིས་པ་ནི་ཉན་ཐོས་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་བཞི་བྱུང་ངོ་། །
en: in the second assembly there were nine hundred forty million,

source: ཉན་ཐོས་འདུས་པ་གསུམ་པ་ནི་ཉན་ཐོས་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་བྱུང་ངོ་། །
en: and in the third assembly there were nine hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་དེའི་གསུང་རབ་ལ་ཁྱིམ་བདག་དབེན་པ་འདོད་པ་ཞེས་བྱ་བ་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཆོས་ཀྱི་དགེ་མཚན་དང་ལྡན་པ།
en: “Present during the thus-gone Unfathomable Light Rays’ discourses was a wealthy householder, a man of great riches and possessions known as Wishing for Disengagement, who bore the virtuous marks of the Dharma.

source: ལེགས་པར་གསུངས་པ་ཡོངས་སུ་ཚོལ་བ་ལ་མངོན་པར་བརྩོན་པ། ལེགས་པར་གསུངས་པའི་དོན་དུ་དེའི་ཡོངས་སུ་མ་བཏང་བ་ཅི་ཡང་མེད་པ་ཞིག་བྱུང་ངོ་། །
en: This man diligently pursued well-spoken words, and there was nothing that he would not sacrifice for the sake of the meaning of teachings.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་ཅེས་བྱ་བ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་གཅོད་པ། དེ་སེམས་ཅན་དམྱལ་བའི་ལམ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་ལམ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་དང་། མིའི་ལམ་དང་། མཐོ་རིས་ཀྱི་ལམ་དང་། མྱ་ངན་ལས་འདས་པའི་ལམ་སྟེ། ལམ་དེ་དག་རབ་ཏུ་སྟོན་པ་ཞིག་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །ཞེས་དེས་བར་སྣང་ལས་སྒྲ་བྱུང་བ་ཐོས་སོ། །
en: One day he heard a voice speaking out of midair: ‘The thus-gone Unfathomable Light Rays cuts through all the doubts of beings. He explains the paths to the realms of hell beings, animals, starving spirits, humans, the heavens, and the transcendence of suffering. Such a teacher has appeared in the world.’

source: དེས་སྒྲ་དེ་ཐོས་ནས་གོས་ཕྱོགས་གཅིག་ཏུ་གཟར་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་བར་སྣང་ལ་ཕྱོགས་ཏེ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: Hearing these words the householder draped his shawl over one shoulder, knelt on his right knee, and then, looking up into space, he spoke this verse:

source: དེ་རིང་བར་སྣང་འདི་དག་ལ། །ཚིག་སྙན་གཏོང་བ་སུ་ཞིག་ལགས། །
en: “ ‘Who speaks such beautiful words From the empty sky today?

source: འདྲེན་པ་དེ་ནི་ག་ལ་བཞུགས། །
en: Where does the great guide reside?

source: དོན་དེ་ཁྱོད་ཀྱིས་བདག་ལ་གསུངས། །
en: Whoever you are, please tell me.’

source: དེས་ཡང་བར་སྣང་ལས་སྒྲ་ཐོས། །
en: “Again words could be heard out of midair:

source: ཤར་ཕྱོགས་ལོགས་ཀྱི་ཕྱོགས་ཆ་ན། །གྲོང་ཁྱེར་ལྷུན་པོ་རྒྱལ་མཚན་དགའ། །
en: “ ‘To the east of here Lies the city known as Mountain Banner of Joy.

source: ཞེས་བྱ་ཡོད་དེ་རྐང་གཉིས་བཞུགས། །ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པར་མཛད། །
en: That is where this man resides, Cutting through all doubts.’

source: དེས་ཡང་ཐལ་མོ་སྦྱར་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Joining his palms, the householder then spoke this verse:

source: དཔག་ཚད་བྱེ་བ་ཇི་སྙེད་ཡོད། །དཔག་ཚད་ཇི་སྙེད་དག་ཏུ་འགྲོ། །
en: “ ‘It may be millions of leagues from here But I shall certainly go there.

source: དཔག་ཚད་ཇི་སྙེད་སོང་བས་སུ། །དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འགྱུར། །
en: Having covered as many leagues as it takes, I shall then see the Thus-Gone One.’

source: དེས་ཡང་བར་སྣང་ལ་འདུག་པ་ལས་སྒྲ་ཐོས་པ།
en: “Then once more he heard words from the space above him:

source: དཔག་ཚད་བྱེ་བ་ཕྲག་བཅུ་དང་། །དཔག་ཚད་བརྒྱ་ཕྲག་བཅུ་དག་ན། །གང་ན་རྫོགས་སངས་རྒྱས་བཞུགས་པ། །
en: “ ‘A hundred million and one thousand Leagues from here Resides the perfect Buddha.

source: དེར་ནི་སོང་སྟེ་ཡོངས་སུ་ཞུས། །
en: You must go there and make your request.’

source: དེས་སྒྲ་དེ་ཐོས་ནས་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: “Hearing these words he then told his ministers,

source: གྲོང་གི་གཙོ་བོ་དག །བཞོན་པ་བཟང་པོ་མྱུར་དུ་སྦྱོར་ཅིག །
en: ‘Quickly, village chiefs, bring me a fine horse.

source: ཤར་གྱི་ཕྱོགས་ཀྱི་ཕྱོགས་ཆ་ན་དཔག་ཚད་བྱེ་བ་ཕྲག་བཅུ་དང་། དཔག་ཚད་སྟོང་ན་གྲོང་ཁྱེར་ལྷུན་པོའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་ཡོད་དེ།
en: One hundred million and one thousand leagues to the east of here lies a city known as Mountain Banner of Joy.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་ཅེས་བྱ་བ་བཞུགས་ཤིང་ཉེ་བར་གནས་ཏེ།
en: That is the place where the thus-gone Unfathomable Light Rays has taken up residence.

source: དེར་དེ་བཞིན་གཤེགས་པ་དེ་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འདོང་ངོ་། །
en: I am leaving so that I may see and venerate that Thus-Gone One.’

source: བློན་པོ་དག་གིས་བཀའ་བཞིན་འཚལ་ཞེས་ཁྱིམ་བདག་དབེན་པ་འདོད་པའི་ལྟར་མཉན་ནས་བཞོན་པ་བཟང་པོ་དག་བཤམས་སོ། །
en: “ ‘As you command,’ said the ministers, and in compliance with the householder’s words they prepared some excellent horses.

source: བཤམས་ནས་གསོལ་པ། ཇོ་བོ་གང་གི་དུས་ལ་དབབ་པར་མཁྱེན་ན་བཞོན་པ་བཟང་པོ་དག་བཤམས་ལགས་སོ། །
en: To the householder they said, ‘Lord, since you know that the time has come, we have prepared fine horses for you.’

source: དེ་ནས་ཁྱིམ་བདག་དབེན་པ་འདོད་པ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་བཞོན་པ་བཟང་པོ་ལ་ཞོན་ཏེ་རང་གི་གྲོང་ཁྱེར་ནས་བྱུང་ངོ་། །
en: Thus, riding an excellent mount, the householder Wishing for Disengagement, who was like a great sal tree, left his city.

source: དེ་གང་དང་གང་དུ་འགྲོ་བ་དེ་དང་དེར་སྐྱེ་བོ་ཐམས་ཅད་ཕྱི་བཞིན་འབྲང་ངོ་། །
en: Wherever he went on his way, all the local people followed him.

source: དེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་ག་ལ་བ་དེར་སོང་སྟེ། སངས་རྒྱས་ཀྱི་མཐུས་གནས་གཙང་མའི་ལྷ་དེ་དག་གིས་རིམ་གྲོ་ཡོངས་སུ་སྤྱད་པར་བྱེད་དོ། །
en: As they journeyed to the Thus-Gone One’s residence, the gods of the pure abodes rendered them service by the power of the Buddha.

source: དེའི་ཚེ་གྲོང་ཁྱེར་ལྷུན་པོའི་རྒྱལ་མཚན་གྱི་ཕྱོགས་ན་སྐྱེད་མོས་ཚལ་ཀུན་ནས་མཛེས་པ་ཞེས་བྱ་བ་དེ་ན་དེ་བཞིན་གཤེགས་པ་དེ་བཞུགས་ཏེ། འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་བཞུགས་པས་སྐྱེད་མོས་ཚལ་དེ་དཔལ་འབར་ཞིང་ལྷན་ནེ་ལྷང་ངེ་བར་རྒྱང་རིང་པོ་ཉིད་ནས་མཐོང་ངོ་། །
en: “The Thus-Gone One was at that time staying in a park called Suṣmā, near the city of Mountain Banner of Joy and, as the party arrived, they saw his awesome figure from afar, seated clear and bright within the park.

source: དེ་བཞོན་པའི་ས་ཇི་ཙམ་པ་དེ་ཙམ་དུ་བཞོན་པས་སོང་སྟེ། བཞོན་པ་ལས་བབས་ནས་རྐང་ཐང་བས་ཡོངས་སུ་བསྐོར་ཅིང་རྐང་ཐང་བས་མདུན་དུ་བདར་ནས།
en: The householder had been riding until that point, but he now dismounted his horse.

source: རྐང་ཐང་བས་སྐྱེད་མོས་ཚལ་ཀུན་ནས་མཛེས་པར་ཞུགས་སོ། །དེ་སྐྱེད་མོས་ཚལ་དེར་ཞུགས་པ་ན།
en: Surrounded by foot soldiers and following a greeting party of infantry, he walked into the Suṣmā Park.

source: སངས་རྒྱས་ཀྱི་མཐུས་རླུང་བསིལ་བ་བདེ་བ་དག་ལངས་ཤིང་སྤོས་ཆུའི་ཆར་དག་མངོན་པར་རབ་ཏུ་བབ་པོ། །
en: Due to the power of the Buddha, as they entered a delightful cooling breeze blew and a trickling shower of scented water fell.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་དེས་ཁྱིམ་བདག་དབེན་པ་འདོད་པ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས
en: “The Thus-Gone Unfathomable Light Rays was aware of the thoughts of the householder Wishing for Disengagement, who was like a great sal tree.

source: བདུད་རྩིའི་འོད་བསིལ་བ་བཏང་ངོ་། །
en: He therefore emitted a cooling, nectar-like light that dispelled all weariness from the journey.

source: དེའི་བདུད་རྩིའི་བསིལ་བ་དེས་དེ་ལམ་གྱིས་དུབ་པ་མེད་པར་མཛད་དོ། །
en: [He therefore emitted a cooling, nectar-like light] that dispelled all weariness from the journey.

source: དེ་བཞིན་གཤེགས་པས་དེའི་ལུས་དུབ་པ་མེད་པར་ཐུགས་སུ་ཆུད་ནས་ཤིང་ཏལ་གཅིག་ཙམ་དུ་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ཏེ་འཆག་གོ། །
en: When the Thus-Gone One saw that the householder was relieved of all discomfort, he ascended into the air and remained seated at the height of a palm tree.

source: ཁྱིམ་བདག་དབེན་པ་འདོད་པ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་དེ་མཛེས་ཤིང་སྡུག །དབང་པོ་ཞི་ཐུགས་ཞི་བ་བར་སྣང་ལ་འཆག་ཅིང་བཞུགས་པ་མཐོང་ངོ་། །
en: The householder Wishing for Disengagement, who was like a great sal tree, beheld the beautiful appearance of the Blessed One as he resided in midair with his senses and mind serene.

source: མཐོང་ནས་ཀྱང་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: The sight made the householder exclaim:
